[
	{
		"id": "rcoreteam_rlanguage_2020",
		"type": "book",
		"event-place": "Vienna, Austria",
		"publisher": "R Foundation for Statistical Computing",
		"publisher-place": "Vienna, Austria",
		"title": "R: A language and environment for statistical computing",
		"version": "4.0",
		"author": [
			{
				"literal": "R Core Team"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2020"
				]
			]
		},
		"citation-key": "rcoreteam_rlanguage_2020"
	},
	{
		"id": "moseleyErrorAnalysisPropagation2013",
		"type": "article-journal",
		"abstract": "Error analysis plays a fundamental role in describing the uncertainty in experimental results. It has several fundamental uses in metabolomics including experimental design, quality control of experiments, the selection of appropriate statistical methods, and the determination of uncertainty in results. Furthermore, the importance of error analysis has grown with the increasing number, complexity, and heterogeneity of measurements characteristic of ‘omics research. The increase in data complexity is particularly problematic for metabolomics, which has more heterogeneity than other omics technologies due to the much wider range of molecular entities detected and measured. This review introduces the fundamental concepts of error analysis as they apply to a wide range of metabolomics experimental designs and it discusses current methodologies for determining the propagation of uncertainty in appropriate metabolomics data analysis. These methodologies include analytical derivation and approximation techniques, Monte Carlo error analysis, and error analysis in metabolic inverse problems. Current limitations of each methodology with respect to metabolomics data analysis are also discussed.",
		"container-title": "Computational and Structural Biotechnology Journal",
		"DOI": "10.5936/csbj.201301006",
		"ISSN": "2001-0370",
		"issue": "5",
		"journalAbbreviation": "Computational and Structural Biotechnology Journal",
		"language": "en",
		"page": "e201301006",
		"source": "ScienceDirect",
		"title": "Error Analysis and Propagation in Metabolomics Data Analysis",
		"URL": "https://www.sciencedirect.com/science/article/pii/S2001037014600490",
		"volume": "4",
		"author": [
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2021",
					7,
					15
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2013",
					1,
					1
				]
			]
		},
		"citation-key": "moseleyErrorAnalysisPropagation2013"
	},
	{
		"id": "mitchellUntargetedLipidomicsNonSmall2021",
		"type": "article-journal",
		"abstract": "Lung cancer remains the leading cause of cancer death worldwide and non-small cell lung carcinoma (NSCLC) represents 85% of newly diagnosed lung cancers. In this study, we utilized our untargeted assignment tool Small Molecule Isotope Resolved Formula Enumerator (SMIRFE) and ultra-high-resolution Fourier transform mass spectrometry to examine lipid profile differences between paired cancerous and non-cancerous lung tissue samples from 86 patients with suspected stage I or IIA primary NSCLC. Correlation and co-occurrence analysis revealed significant lipid profile differences between cancer and non-cancer samples. Further analysis of machine-learned lipid categories for the differentially abundant molecular formulas identified a high abundance sterol, high abundance and high m/z sphingolipid, and low abundance glycerophospholipid metabolic phenotype across the NSCLC samples. At the class level, higher abundances of sterol esters and lower abundances of cardiolipins were observed suggesting altered stearoyl-CoA desaturase 1 (SCD1) or acetyl-CoA acetyltransferase (ACAT1) activity and altered human cardiolipin synthase 1 or lysocardiolipin acyltransferase activity respectively, the latter of which is known to confer apoptotic resistance. The presence of a shared metabolic phenotype across a variety of genetically distinct NSCLC subtypes suggests that this phenotype is necessary for NSCLC development and may result from multiple distinct genetic lesions. Thus, targeting the shared affected pathways may be beneficial for a variety of genetically distinct NSCLC subtypes.",
		"container-title": "Metabolites",
		"DOI": "10.3390/metabo11110740",
		"issue": "11",
		"language": "en",
		"note": "number: 11\npublisher: Multidisciplinary Digital Publishing Institute",
		"page": "740",
		"source": "www.mdpi.com",
		"title": "Untargeted Lipidomics of Non-Small Cell Lung Carcinoma Demonstrates Differentially Abundant Lipid Classes in Cancer vs. Non-Cancer Tissue",
		"URL": "https://www.mdpi.com/2218-1989/11/11/740",
		"volume": "11",
		"author": [
			{
				"family": "Mitchell",
				"given": "Joshua M."
			},
			{
				"family": "Flight",
				"given": "Robert M."
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					1,
					6
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2021",
					11
				]
			]
		},
		"citation-key": "mitchellUntargetedLipidomicsNonSmall2021"
	},
	{
		"id": "vaughanFurrrApplyMapping2021",
		"type": "report",
		"genre": "manual",
		"title": "furrr: Apply mapping functions in parallel using futures",
		"URL": "https://CRAN.R-project.org/package=furrr",
		"author": [
			{
				"family": "Vaughan",
				"given": "Davis"
			},
			{
				"family": "Dancho",
				"given": "Matt"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "vaughanFurrrApplyMapping2021"
	},
	{
		"id": "mitchellNewMethodsIdentify2018",
		"type": "article-journal",
		"abstract": "Direct injection Fourier-transform mass spectrometry (FT-MS) allows for the high-throughput and high-resolution detection of thousands of metabolite-associated isotopologues. However, spectral artifacts can generate large numbers of spectral features (peaks) that do not correspond to known compounds. Misassignment of these artifactual features creates interpretive errors and limits our ability to discern the role of representative features within living systems.",
		"container-title": "Metabolomics",
		"DOI": "10.1007/s11306-018-1426-9",
		"ISSN": "1573-3890",
		"issue": "10",
		"journalAbbreviation": "Metabolomics",
		"language": "en",
		"page": "125",
		"source": "Springer Link",
		"title": "New methods to identify high peak density artifacts in Fourier transform mass spectra and to mitigate their effects on high-throughput metabolomic data analysis",
		"URL": "https://doi.org/10.1007/s11306-018-1426-9",
		"volume": "14",
		"author": [
			{
				"family": "Mitchell",
				"given": "Joshua M."
			},
			{
				"family": "Flight",
				"given": "Robert M."
			},
			{
				"family": "Wang",
				"given": "Qing Jun"
			},
			{
				"family": "Higashi",
				"given": "Richard M."
			},
			{
				"family": "Fan",
				"given": "Teresa W.-M."
			},
			{
				"family": "Lane",
				"given": "Andrew N."
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					14
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2018",
					9,
					17
				]
			]
		},
		"citation-key": "mitchellNewMethodsIdentify2018"
	},
	{
		"id": "lawrenceSoftwareComputingAnnotating2013a",
		"type": "article-journal",
		"abstract": "We describe Bioconductor infrastructure for representing and computing on annotated genomic ranges and integrating genomic data with the statistical computing features of R and its extensions. At the core of the infrastructure are three packages: IRanges, GenomicRanges, and GenomicFeatures. These packages provide scalable data structures for representing annotated ranges on the genome, with special support for transcript structures, read alignments and coverage vectors. Computational facilities include efficient algorithms for overlap and nearest neighbor detection, coverage calculation and other range operations. This infrastructure directly supports more than 80 other Bioconductor packages, including those for sequence analysis, differential expression analysis and visualization.",
		"container-title": "PLOS Computational Biology",
		"DOI": "10.1371/journal.pcbi.1003118",
		"ISSN": "1553-7358",
		"issue": "8",
		"journalAbbreviation": "PLOS Computational Biology",
		"language": "en",
		"note": "publisher: Public Library of Science",
		"page": "e1003118",
		"source": "PLoS Journals",
		"title": "Software for Computing and Annotating Genomic Ranges",
		"URL": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1003118",
		"volume": "9",
		"author": [
			{
				"family": "Lawrence",
				"given": "Michael"
			},
			{
				"family": "Huber",
				"given": "Wolfgang"
			},
			{
				"family": "Pagès",
				"given": "Hervé"
			},
			{
				"family": "Aboyoun",
				"given": "Patrick"
			},
			{
				"family": "Carlson",
				"given": "Marc"
			},
			{
				"family": "Gentleman",
				"given": "Robert"
			},
			{
				"family": "Morgan",
				"given": "Martin T."
			},
			{
				"family": "Carey",
				"given": "Vincent J."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					14
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2013",
					8,
					8
				]
			]
		},
		"citation-key": "lawrenceSoftwareComputingAnnotating2013a"
	},
	{
		"id": "borchersPracmaPracticalNumerical2021",
		"type": "report",
		"genre": "manual",
		"title": "pracma: Practical numerical math functions",
		"URL": "https://CRAN.R-project.org/package=pracma",
		"author": [
			{
				"family": "Borchers",
				"given": "Hans W."
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "borchersPracmaPracticalNumerical2021"
	},
	{
		"id": "flightInformationContentInformedKendalltauCorrelation2022",
		"type": "article-journal",
		"abstract": "Almost all correlation measures currently available are unable to handle missing values. Typically, missing values are either ignored completely by removing them or are imputed and used in the calculation of the correlation coefficient. In both cases, the correlation value will be impacted based on a perspective that missing data represents no useful information. However, missing values occur in real data sets for a variety of reasons. In omics data sets that are derived from analytical measurements, the primary reason for missing values is that a specific measurable phenomenon falls below the detection limits of the analytical instrumentation. These missing data are not missing at random, but represent some information by their “missingness.” Therefore, we propose an information-content-informed Kendall-tau (ICI-Kt) correlation coefficient that allows missing values to carry explicit information in the determination of concordant and discordant pairs. With both simulated and real data sets from RNA-seq experiments, we demonstrate that the ICI-Kt allows for the inclusion of missing data values as interpretable information. Moreover, our implementation of ICI-Kt uses a mergesort-like algorithm that provides O(nlog(n)) computational performance. Finally, we show that approximate ICI-Kt correlations can be calculated using smaller feature subsets of large data sets with significant time savings, which has practical computational value when feature sizes are very large.\nThe ICI-Kt correlation calculation is available in an R package and Python module on GitHub at https://github.com/moseleyBionformaticsLab/ICIKendallTau and https://github.com/moseleyBionformaticsLab/icikt, respectively.",
		"DOI": "10.1101/2022.02.24.481854",
		"language": "en",
		"note": "section: New Results\ntype: article",
		"page": "2022.02.24.481854",
		"source": "bioRxiv",
		"title": "Information-Content-Informed Kendall-tau Correlation: Utilizing Missing Values",
		"title-short": "Information-Content-Informed Kendall-tau Correlation",
		"URL": "https://www.biorxiv.org/content/10.1101/2022.02.24.481854v1",
		"author": [
			{
				"family": "Flight",
				"given": "Robert M."
			},
			{
				"family": "Bhatt",
				"given": "Praneeth S."
			},
			{
				"family": "Moseley",
				"given": "Hunter NB"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					16
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2022",
					2,
					28
				]
			]
		},
		"citation-key": "flightInformationContentInformedKendalltauCorrelation2022"
	},
	{
		"id": "TruncatedNormalDistribution2022",
		"type": "entry-encyclopedia",
		"abstract": "In probability and statistics, the truncated normal distribution is the probability distribution derived from that of a normally distributed random variable by bounding the random variable from either below or above (or both). The truncated normal distribution has wide applications in statistics and econometrics. For example, it is used to model the probabilities of the binary outcomes in the probit model and to model censored data in the tobit model.",
		"container-title": "Wikipedia",
		"language": "en",
		"note": "Page Version ID: 1074943875",
		"source": "Wikipedia",
		"title": "Truncated normal distribution",
		"URL": "https://en.wikipedia.org/w/index.php?title=Truncated_normal_distribution&oldid=1074943875",
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					16
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2022",
					3,
					3
				]
			]
		},
		"citation-key": "TruncatedNormalDistribution2022"
	},
	{
		"id": "ledfordSpaceChargeEffects1984",
		"type": "article-journal",
		"archive_location": "world",
		"container-title": "Analytical Chemistry",
		"DOI": "10.1021/ac00278a027",
		"issue": "14",
		"journalAbbreviation": "Anal Chem",
		"language": "EN",
		"note": "publisher: American Chemical Society",
		"page": "2744 - 2748",
		"title": "Space charge effects in Fourier transform mass spectrometry. II. Mass calibration",
		"URL": "https://pubs.acs.org/doi/pdf/10.1021/ac00278a027",
		"volume": "56",
		"author": [
			{
				"family": "Ledford",
				"given": "Edward B."
			},
			{
				"family": "Rempel",
				"given": "Don L."
			},
			{
				"family": "Gross",
				"given": "M. L."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					22
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"1984"
				]
			]
		},
		"citation-key": "ledfordSpaceChargeEffects1984"
	},
	{
		"id": "burkardtTruncatedNormalDistribution",
		"type": "article-journal",
		"abstract": "The normal distribution is a common model of randomness. Unlike the uniform distribution, it proposes a most probable value which is also the mean, while other values occur with a probability that decreases in a regular way with distance from the mean. This behavior is mathematically very satisfying, and has an easily observed correspondence with many physical processes. One drawback of the normal distribution, however, is that it supplies a positive probability density to every value in the range (−∞, +∞), although the actual probability of an extreme event will be very low. In many cases, it is desired to use the normal distribution to describe the random variation of a quantity that, for physical reasons, must be strictly positive. A mathematically defensible way to preserve the main features of the normal distribution while avoiding extreme values involves the truncated normal distribution, in which the range of deﬁnition is made ﬁnite at one or both ends of the interval. It is the purpose of this report to describe the truncation process, to consider how certain basic statistical properties of the new distribution can be determined, to show how to eﬃciently sample the distribution, and how to construct an associated quadrature rule, or even a sparse grid quadrature rule for a problem with multidimensional randomness.",
		"language": "en",
		"page": "35",
		"source": "Zotero",
		"title": "The Truncated Normal Distribution",
		"author": [
			{
				"family": "Burkardt",
				"given": "John"
			}
		],
		"citation-key": "burkardtTruncatedNormalDistribution"
	},
	{
		"id": "moseleyCorrectingEffectsNatural2010",
		"type": "article-journal",
		"abstract": "Stable isotope tracing with ultra-high resolution Fourier transform-ion cyclotron resonance-mass spectrometry (FT-ICR-MS) can provide simultaneous determination of hundreds to thousands of metabolite isotopologue species without the need for chromatographic separation. Therefore, this experimental metabolomics methodology may allow the tracing of metabolic pathways starting from stable-isotope-enriched precursors, which can improve our mechanistic understanding of cellular metabolism. However, contributions to the observed intensities arising from the stable isotope's natural abundance must be subtracted (deisotoped) from the raw isotopologue peaks before interpretation. Previously posed deisotoping problems are sidestepped due to the isotopic resolution and identification of individual isotopologue peaks. This peak resolution and identification come from the very high mass resolution and accuracy of FT-ICR-MS and present an analytically solvable deisotoping problem, even in the context of stable-isotope enrichment.",
		"container-title": "BMC Bioinformatics",
		"DOI": "10.1186/1471-2105-11-139",
		"ISSN": "1471-2105",
		"issue": "1",
		"journalAbbreviation": "BMC Bioinformatics",
		"page": "139",
		"source": "BioMed Central",
		"title": "Correcting for the effects of natural abundance in stable isotope resolved metabolomics experiments involving ultra-high resolution mass spectrometry",
		"URL": "https://doi.org/10.1186/1471-2105-11-139",
		"volume": "11",
		"author": [
			{
				"family": "Moseley",
				"given": "Hunter NB"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2010",
					3,
					17
				]
			]
		},
		"citation-key": "moseleyCorrectingEffectsNatural2010"
	},
	{
		"id": "carreerComputationalFrameworkHighThroughput2013",
		"type": "article-journal",
		"abstract": "New metabolomics applications of ultra-high resolution and accuracy mass spectrometry can provide thousands of detectable isotopologues, with the number of potentially detectable isotopologues increasing exponentially with the number of stable isotopes used in newer isotope tracing methods like stable isotope-resolved metabolomics (SIRM) experiments. This huge increase in usable data requires software capable of correcting the large number of isotopologue peaks resulting from SIRM experiments in a timely manner. We describe the design of a new algorithm and software system capable of handling these high volumes of data, while including quality control methods for maintaining data quality. We validate this new algorithm against a previous single isotope correction algorithm in a two-step cross-validation. Next, we demonstrate the algorithm and correct for the effects of natural abundance for both 13C and 15N isotopes on a set of raw isotopologue intensities of UDP-N-acetyl-D-glucosamine derived from a 13C/15N-tracing experiment. Finally, we demonstrate the algorithm on a full omics-level dataset.",
		"container-title": "Metabolites",
		"DOI": "10.3390/metabo3040853",
		"ISSN": "2218-1989",
		"issue": "4",
		"language": "en",
		"note": "number: 4\npublisher: Multidisciplinary Digital Publishing Institute",
		"page": "853-866",
		"source": "www.mdpi.com",
		"title": "A Computational Framework for High-Throughput Isotopic Natural Abundance Correction of Omics-Level Ultra-High Resolution FT-MS Datasets",
		"URL": "https://www.mdpi.com/2218-1989/3/4/853",
		"volume": "3",
		"author": [
			{
				"family": "Carreer",
				"given": "William J."
			},
			{
				"family": "Flight",
				"given": "Robert M."
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2013",
					12
				]
			]
		},
		"citation-key": "carreerComputationalFrameworkHighThroughput2013"
	},
	{
		"id": "kindMetabolomicDatabaseAnnotations2006",
		"type": "article-journal",
		"abstract": "Metabolomic studies are targeted at identifying and quantifying all metabolites in a given biological context. Among the tools used for metabolomic research, mass spectrometry is one of the most powerful tools. However, metabolomics by mass spectrometry always reveals a high number of unknown compounds which complicate in depth mechanistic or biochemical understanding. In principle, mass spectrometry can be utilized within strategies of de novo structure elucidation of small molecules, starting with the computation of the elemental composition of an unknown metabolite using accurate masses with errors <5 ppm (parts per million). However even with very high mass accuracy (<1 ppm) many chemically possible formulae are obtained in higher mass regions. In automatic routines an additional orthogonal filter therefore needs to be applied in order to reduce the number of potential elemental compositions. This report demonstrates the necessity of isotope abundance information by mathematical confirmation of the concept.",
		"container-title": "BMC Bioinformatics",
		"DOI": "10.1186/1471-2105-7-234",
		"ISSN": "1471-2105",
		"issue": "1",
		"journalAbbreviation": "BMC Bioinformatics",
		"page": "234",
		"source": "BioMed Central",
		"title": "Metabolomic database annotations via query of elemental compositions: Mass accuracy is insufficient even at less than 1 ppm",
		"title-short": "Metabolomic database annotations via query of elemental compositions",
		"URL": "https://doi.org/10.1186/1471-2105-7-234",
		"volume": "7",
		"author": [
			{
				"family": "Kind",
				"given": "Tobias"
			},
			{
				"family": "Fiehn",
				"given": "Oliver"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2006",
					4,
					28
				]
			]
		},
		"citation-key": "kindMetabolomicDatabaseAnnotations2006"
	},
	{
		"id": "eylesMethodsStudyProtein2004",
		"type": "article-journal",
		"abstract": "It is clear that merely knowing the structure of a protein alone is not sufficient to fully understand its behavior: knowledge also of the dynamic events that occur within proteins is vital to elucidate their function and folding. In recent years, mass spectrometry has come to the forefront as a powerful biophysical method, which can shed light both on the structure and dynamics of proteins. Hydrogen exchange monitored by mass spectrometry is a highly sensitive marker of the backbone dynamics in solution that, combined with gas phase dissociation techniques, can provide a high resolution tool to locate the dynamic regions of a protein. Additionally, charge state distributions in electrospray mass spectra yield insight into the nature and population of alternate structural states present at equilibrium. In this paper, we describe several applications of these methodologies to probe the dynamic events key to the structure, folding, and biological functions of proteins.",
		"collection-title": "Investigating Protein Folding, Misfolding and Nonnative States:  Experimental and Theoretical Methods",
		"container-title": "Methods",
		"DOI": "10.1016/j.ymeth.2004.03.015",
		"ISSN": "1046-2023",
		"issue": "1",
		"journalAbbreviation": "Methods",
		"language": "en",
		"page": "88-99",
		"source": "ScienceDirect",
		"title": "Methods to study protein dynamics and folding by mass spectrometry",
		"URL": "https://www.sciencedirect.com/science/article/pii/S1046202304000544",
		"volume": "34",
		"author": [
			{
				"family": "Eyles",
				"given": "Stephen J"
			},
			{
				"family": "Kaltashov",
				"given": "Igor A"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2004",
					9,
					1
				]
			]
		},
		"citation-key": "eylesMethodsStudyProtein2004"
	},
	{
		"id": "dettmerMassSpectrometrybasedMetabolomics2007",
		"type": "article-journal",
		"abstract": "This review presents an overview of the dynamically developing field of mass spectrometry-based metabolomics. Metabolomics aims at the comprehensive and quantitative analysis of wide arrays of metabolites in biological samples. These numerous analytes have very diverse physico-chemical properties and occur at different abundance levels. Consequently, comprehensive metabolomics investigations are primarily a challenge for analytical chemistry and specifically mass spectrometry has vast potential as a tool for this type of investigation. Metabolomics require special approaches for sample preparation, separation, and mass spectrometric analysis. Current examples of those approaches are described in this review. It primarily focuses on metabolic fingerprinting, a technique that analyzes all detectable analytes in a given sample with subsequent classification of samples and identification of differentially expressed metabolites, which define the sample classes. To perform this complex task, data analysis tools, metabolite libraries, and databases are required. Therefore, recent advances in metabolomics bioinformatics are also discussed. © 2006 Wiley Periodicals, Inc., Mass Spec Rev 26:51–78, 2007",
		"container-title": "Mass Spectrometry Reviews",
		"DOI": "10.1002/mas.20108",
		"ISSN": "1098-2787",
		"issue": "1",
		"language": "en",
		"note": "_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/mas.20108",
		"page": "51-78",
		"source": "Wiley Online Library",
		"title": "Mass spectrometry-based metabolomics",
		"URL": "https://onlinelibrary.wiley.com/doi/abs/10.1002/mas.20108",
		"volume": "26",
		"author": [
			{
				"family": "Dettmer",
				"given": "Katja"
			},
			{
				"family": "Aronov",
				"given": "Pavel A."
			},
			{
				"family": "Hammock",
				"given": "Bruce D."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2007"
				]
			]
		},
		"citation-key": "dettmerMassSpectrometrybasedMetabolomics2007"
	},
	{
		"id": "yangChloroformateDerivatizationTracing2017",
		"type": "article-journal",
		"abstract": "Amino acids have crucial roles in central metabolism, both anabolic and catabolic. To elucidate these roles, steady-state concentrations of amino acids alone are insufficient, as each amino acid participates in multiple pathways and functions in a complex network, which can also be compartmentalized. Stable Isotope-Resolved Metabolomics (SIRM) is an approach that uses atom-resolved tracking of metabolites through biochemical transformations in cells, tissues, or whole organisms. Using different elemental stable isotopes to label multiple metabolite precursors makes it possible to resolve simultaneously the utilization of these precursors in a single experiment. Conversely, a single precursor labeled with two (or more) different elemental isotopes can trace the allocation of e.g. C and N atoms through the network. Such dual-label experiments however challenge the resolution of conventional mass spectrometers, which must distinguish the neutron mass differences among different elemental isotopes. This requires ultrahigh resolution Fourier transform mass spectrometry (UHR-FTMS). When combined with direct infusion nano-electrospray ion source (nano-ESI), UHR-FTMS can provide rapid, global, and quantitative analysis of all possible mass isotopologues of metabolites. Unfortunately, very low mass polar metabolites such as amino acids can be difficult to analyze by current models of UHR-FTMS, plus the high salt content present in typical cell or tissue polar extracts may cause unacceptable ion suppression for sources such as nano-ESI. Here we describe a modified method of ethyl chloroformate (ECF) derivatization of amino acids to enable rapid quantitative analysis of stable isotope labeled amino acids using nano-ESI UHR-FTMS. This method showed excellent linearity with quantifiable limits in the low nanomolar range represented in microgram quantities of biological specimens, which results in extracts with total analyte abundances in the low to sub-femtomole range. We have applied this method to profile amino acids and their labeling patterns in 13C and 2H doubly labeled PC9 cell extracts, cancerous and non-cancerous tissue extracts from a lung cancer patient and their protein hydrolysates as well as plasma extracts from mice fed with a liquid diet containing 13C6-glucose (Glc). The multi-element isotopologue distributions provided key insights into amino acid metabolism and intracellular pools in human lung cancer tissues in high detail. The 13C labeling of Asp and Glu revealed de novo synthesis of these amino acids from 13C6-Glc via the Krebs cycle, specifically the elevated level of 13C3-labeled Asp and Glu in cancerous versus non-cancerous lung tissues was consistent with enhanced pyruvate carboxylation. In addition, tracking the fate of double tracers, (13C6-Glc + 2H2-Gly or 13C6-Glc + 2H3-Ser) in PC9 cells clearly resolved pools of Ser and Gly synthesized de novo from 13C6-Glc (13C3-Ser and 13C2-Gly) versus Ser and Gly derived from external sources (2H3-Ser, 2H2-Gly). Moreover the complex 2H labeling patterns of the latter were results of Ser and Gly exchange through active Ser-Gly one-carbon metabolic pathway in PC9 cells.",
		"container-title": "Analytica Chimica Acta",
		"DOI": "10.1016/j.aca.2017.04.014",
		"ISSN": "0003-2670",
		"journalAbbreviation": "Analytica Chimica Acta",
		"language": "en",
		"page": "63-73",
		"source": "ScienceDirect",
		"title": "Chloroformate derivatization for tracing the fate of Amino acids in cells and tissues by multiple stable isotope resolved metabolomics (mSIRM)",
		"URL": "https://www.sciencedirect.com/science/article/pii/S0003267017304579",
		"volume": "976",
		"author": [
			{
				"family": "Yang",
				"given": "Ye"
			},
			{
				"family": "Fan",
				"given": "Teresa W-M."
			},
			{
				"family": "Lane",
				"given": "Andrew N."
			},
			{
				"family": "Higashi",
				"given": "Richard M."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2017",
					7,
					11
				]
			]
		},
		"citation-key": "yangChloroformateDerivatizationTracing2017"
	},
	{
		"id": "creekStableIsotopeAssistedMetabolomics2012",
		"type": "article-journal",
		"abstract": "The combination of high-resolution LC–MS-based untargeted metabolomics with stable isotope tracing provides a global overview of the cellular fate of precursor metabolites. This methodology enables detection of putative metabolites from biological samples and simultaneous quantification of the pattern and extent of isotope labeling. Labeling of Trypanosoma brucei cell cultures with 50% uniformly 13C-labeled glucose demonstrated incorporation of glucose-derived carbon into 187 of 588 putatively identified metabolites in diverse pathways including carbohydrate, nucleotide, lipid, and amino acid metabolism. Labeling patterns confirmed the metabolic pathways responsible for the biosynthesis of many detected metabolites, and labeling was detected in unexpected metabolites, including two higher sugar phosphates annotated as octulose phosphate and nonulose phosphate. This untargeted approach to stable isotope tracing facilitates the biochemical analysis of known pathways and yields rapid identification of previously unexplored areas of metabolism.",
		"container-title": "Analytical Chemistry",
		"DOI": "10.1021/ac3018795",
		"ISSN": "0003-2700",
		"issue": "20",
		"journalAbbreviation": "Anal. Chem.",
		"note": "publisher: American Chemical Society",
		"page": "8442-8447",
		"source": "ACS Publications",
		"title": "Stable Isotope-Assisted Metabolomics for Network-Wide Metabolic Pathway Elucidation",
		"URL": "https://doi.org/10.1021/ac3018795",
		"volume": "84",
		"author": [
			{
				"family": "Creek",
				"given": "Darren J."
			},
			{
				"family": "Chokkathukalam",
				"given": "Achuthanunni"
			},
			{
				"family": "Jankevics",
				"given": "Andris"
			},
			{
				"family": "Burgess",
				"given": "Karl E. V."
			},
			{
				"family": "Breitling",
				"given": "Rainer"
			},
			{
				"family": "Barrett",
				"given": "Michael P."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2012",
					10,
					16
				]
			]
		},
		"citation-key": "creekStableIsotopeAssistedMetabolomics2012"
	},
	{
		"id": "hillerNontargetedElucidationMetabolic2010",
		"type": "article-journal",
		"abstract": "Systems level tools for the quantitative analysis of metabolic networks are required to engineer metabolism for biomedical and industrial applications. While current metabolomics techniques enable high-throughput quantification of metabolites, these methods provide minimal information on the rates and connectivity of metabolic pathways. Here we present a new method, nontargeted tracer fate detection (NTFD), that expands upon the concept of metabolomics to solve the above problems. Through the combined use of stable isotope tracers and chromatography coupled to mass spectrometry, our computational analysis enables the quantitative detection of all measurable metabolites derived from a specific labeled compound. Without a priori knowledge of a reaction network or compound library, NTFD provides information about relative flux magnitudes into each metabolite pool by determining the mass isotopomer distribution for all labeled compounds. This novel method adds a new dimension to the metabolomics tool box and provides a framework for global analysis of metabolic fluxes.",
		"container-title": "Analytical Chemistry",
		"DOI": "10.1021/ac1011574",
		"ISSN": "0003-2700",
		"issue": "15",
		"journalAbbreviation": "Anal. Chem.",
		"note": "publisher: American Chemical Society",
		"page": "6621-6628",
		"source": "ACS Publications",
		"title": "Nontargeted Elucidation of Metabolic Pathways Using Stable-Isotope Tracers and Mass Spectrometry",
		"URL": "https://doi.org/10.1021/ac1011574",
		"volume": "82",
		"author": [
			{
				"family": "Hiller",
				"given": "Karsten"
			},
			{
				"family": "Metallo",
				"given": "Christian M."
			},
			{
				"family": "Kelleher",
				"given": "Joanne K"
			},
			{
				"family": "Stephanopoulos",
				"given": "Gregory"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2010",
					8,
					1
				]
			]
		},
		"citation-key": "hillerNontargetedElucidationMetabolic2010"
	},
	{
		"id": "fanStableIsotoperesolvedMetabolomics2012",
		"type": "article-journal",
		"abstract": "Advances in analytical methodologies, principally nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry (MS), during the last decade have made large-scale analysis of the human metabolome a reality. This is leading to the reawakening of the importance of metabolism in human diseases, particularly cancer. The metabolome is the functional readout of the genome, functional genome, and proteome; it is also an integral partner in molecular regulations for homeostasis. The interrogation of the metabolome, or metabolomics, is now being applied to numerous diseases, largely by metabolite profiling for biomarker discovery, but also in pharmacology and therapeutics. Recent advances in stable isotope tracer-based metabolomic approaches enable unambiguous tracking of individual atoms through compartmentalized metabolic networks directly in human subjects, which promises to decipher the complexity of the human metabolome at an unprecedented pace. This knowledge will revolutionize our understanding of complex human diseases, clinical diagnostics, as well as individualized therapeutics and drug response. In this review, we focus on the use of stable isotope tracers with metabolomics technologies for understanding metabolic network dynamics in both model systems and in clinical applications. Atom-resolved isotope tracing via the two major analytical platforms, NMR and MS, has the power to determine novel metabolic reprogramming in diseases, discover new drug targets, and facilitates ADME studies. We also illustrate new metabolic tracer-based imaging technologies, which enable direct visualization of metabolic processes in vivo. We further outline current practices and future requirements for biochemoinformatics development, which is an integral part of translating stable isotope-resolved metabolomics into clinical reality.",
		"container-title": "Pharmacology & Therapeutics",
		"DOI": "10.1016/j.pharmthera.2011.12.007",
		"ISSN": "0163-7258",
		"issue": "3",
		"journalAbbreviation": "Pharmacology & Therapeutics",
		"language": "en",
		"page": "366-391",
		"source": "ScienceDirect",
		"title": "Stable isotope-resolved metabolomics and applications for drug development",
		"URL": "https://www.sciencedirect.com/science/article/pii/S0163725811002300",
		"volume": "133",
		"author": [
			{
				"family": "Fan",
				"given": "Teresa W. -M."
			},
			{
				"family": "Lorkiewicz",
				"given": "Pawel K."
			},
			{
				"family": "Sellers",
				"given": "Katherine"
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			},
			{
				"family": "Higashi",
				"given": "Richard M."
			},
			{
				"family": "Lane",
				"given": "Andrew N."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2012",
					3,
					1
				]
			]
		},
		"citation-key": "fanStableIsotoperesolvedMetabolomics2012"
	},
	{
		"id": "moseleyNovelDeconvolutionMethod2011",
		"type": "article-journal",
		"abstract": "Stable isotope tracing is a powerful technique for following the fate of individual atoms through metabolic pathways. Measuring isotopic enrichment in metabolites provides quantitative insights into the biosynthetic network and enables flux analysis as a function of external perturbations. NMR and mass spectrometry are the techniques of choice for global profiling of stable isotope labeling patterns in cellular metabolites. However, meaningful biochemical interpretation of the labeling data requires both quantitative analysis and complex modeling. Here, we demonstrate a novel approach that involved acquiring and modeling the timecourses of 13C isotopologue data for UDP-N-acetyl-D-glucosamine (UDP-GlcNAc) synthesized from [U-13C]-glucose in human prostate cancer LnCaP-LN3 cells. UDP-GlcNAc is an activated building block for protein glycosylation, which is an important regulatory mechanism in the development of many prominent human diseases including cancer and diabetes.",
		"container-title": "BMC Biology",
		"DOI": "10.1186/1741-7007-9-37",
		"ISSN": "1741-7007",
		"issue": "1",
		"journalAbbreviation": "BMC Biology",
		"page": "37",
		"source": "BioMed Central",
		"title": "A novel deconvolution method for modeling UDP-N-acetyl-D-glucosamine biosynthetic pathways based on 13C mass isotopologue profiles under non-steady-state conditions",
		"URL": "https://doi.org/10.1186/1741-7007-9-37",
		"volume": "9",
		"author": [
			{
				"family": "Moseley",
				"given": "Hunter NB"
			},
			{
				"family": "Lane",
				"given": "Andrew N."
			},
			{
				"family": "Belshoff",
				"given": "Alex C."
			},
			{
				"family": "Higashi",
				"given": "Richard M."
			},
			{
				"family": "Fan",
				"given": "Teresa WM"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2011",
					5,
					31
				]
			]
		},
		"citation-key": "moseleyNovelDeconvolutionMethod2011"
	},
	{
		"id": "verdegemMAIMSSoftwareTool2017",
		"type": "article-journal",
		"abstract": "Metabolic tracer analysis (MTA) is a collection of principles, rules and tools for the interpretation of stable isotope incorporation patterns. One example is the GAIMS algorithm for the deconvolution of the UDP-GlcNAc 13C mass isotopologue profile. GAIMS has been presented as a powerful, yet currently unavailable, proof-of-concept-only technique.",
		"container-title": "Metabolomics",
		"DOI": "10.1007/s11306-017-1250-7",
		"ISSN": "1573-3890",
		"issue": "10",
		"journalAbbreviation": "Metabolomics",
		"language": "en",
		"page": "123",
		"source": "Springer Link",
		"title": "MAIMS: a software tool for sensitive metabolic tracer analysis through the deconvolution of 13C mass isotopologue profiles of large composite metabolites",
		"title-short": "MAIMS",
		"URL": "https://doi.org/10.1007/s11306-017-1250-7",
		"volume": "13",
		"author": [
			{
				"family": "Verdegem",
				"given": "Dries"
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			},
			{
				"family": "Vermaelen",
				"given": "Wesley"
			},
			{
				"family": "Sanchez",
				"given": "Abel Acosta"
			},
			{
				"family": "Ghesquière",
				"given": "Bart"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2017",
					9,
					5
				]
			]
		},
		"citation-key": "verdegemMAIMSSoftwareTool2017"
	},
	{
		"id": "fanAlteredRegulationMetabolic2009",
		"type": "article-journal",
		"abstract": "Metabolic perturbations arising from malignant transformation have not been systematically characterized in human lung cancers in situ. Stable isotope resolved metabolomic analysis (SIRM) enables functional analysis of gene dysregulations in lung cancer. To this purpose, metabolic changes were investigated by infusing uniformly labeled 13C-glucose into human lung cancer patients, followed by resection and processing of paired non-cancerous lung and non small cell carcinoma tissues. NMR and GC-MS were used for 13C-isotopomer-based metabolomic analysis of the extracts of tissues and blood plasma.",
		"container-title": "Molecular Cancer",
		"DOI": "10.1186/1476-4598-8-41",
		"ISSN": "1476-4598",
		"issue": "1",
		"journalAbbreviation": "Molecular Cancer",
		"page": "41",
		"source": "BioMed Central",
		"title": "Altered regulation of metabolic pathways in human lung cancer discerned by 13C stable isotope-resolved metabolomics (SIRM)",
		"URL": "https://doi.org/10.1186/1476-4598-8-41",
		"volume": "8",
		"author": [
			{
				"family": "Fan",
				"given": "Teresa WM"
			},
			{
				"family": "Lane",
				"given": "Andrew N."
			},
			{
				"family": "Higashi",
				"given": "Richard M."
			},
			{
				"family": "Farag",
				"given": "Mohamed A."
			},
			{
				"family": "Gao",
				"given": "Hong"
			},
			{
				"family": "Bousamra",
				"given": "Michael"
			},
			{
				"family": "Miller",
				"given": "Donald M."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2009",
					6,
					26
				]
			]
		},
		"citation-key": "fanAlteredRegulationMetabolic2009"
	},
	{
		"id": "lorkiewiczHighInformationThroughput2012",
		"type": "article-journal",
		"abstract": "Fourier transform-ion cyclotron resonance-mass spectrometry (FTICR-MS) is capable of acquiring unmatched quality of isotopologue data for stable isotope resolved metabolomics (SIRM). This capability drives the need for a continuous ion introduction for obtaining optimal isotope ratios. Here we report the simultaneous analysis of mono and dinucleotides from crude polar extracts by FTICR-MS by adapting an ion-pairing sample preparation method for LC–MS analysis. This involves a rapid cleanup of extracted nucleotides on pipet tips containing a C18 stationary phase, which enabled global analysis of nucleotides and their 13C isotopologues at nanomolar concentrations by direct infusion nanoelectrospray FTICR-MS with 5 min of data acquisition. The resolution and mass accuracy enabled computer-assisted unambiguous assignment of most nucleotide species, including all phosphorylated forms of the adenine, guanine, uracil and cytosine nucleotides, NAD+, NADH, NADP+, NADPH, cyclic nucleotides, several UDP-hexoses, and all their 13C isotopologues. The method was applied to a SIRM study on human lung adenocarcinoma A549 cells grown in [U-13C] glucose with or without the anti-cancer agent methylseleninic acid. At m/z resolving power of 400,000, 13C-isotopologues of nucleotides were fully resolved from all other elemental isotopologues, thus allowing their 13C fractional enrichment to be accurately determined. The method achieves both high sample and high information throughput analysis of nucleotides for metabolic pathway reconstruction in SIRM investigations.",
		"container-title": "Metabolomics",
		"DOI": "10.1007/s11306-011-0388-y",
		"ISSN": "1573-3890",
		"issue": "5",
		"journalAbbreviation": "Metabolomics",
		"language": "en",
		"page": "930-939",
		"source": "Springer Link",
		"title": "High information throughput analysis of nucleotides and their isotopically enriched isotopologues by direct-infusion FTICR-MS",
		"URL": "https://doi.org/10.1007/s11306-011-0388-y",
		"volume": "8",
		"author": [
			{
				"family": "Lorkiewicz",
				"given": "Pawel"
			},
			{
				"family": "Higashi",
				"given": "Richard M."
			},
			{
				"family": "Lane",
				"given": "Andrew N."
			},
			{
				"family": "Fan",
				"given": "Teresa W.-M."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2012",
					10,
					1
				]
			]
		},
		"citation-key": "lorkiewiczHighInformationThroughput2012"
	},
	{
		"id": "goodacreMetabolomicsNumbersAcquiring2004",
		"type": "article-journal",
		"container-title": "Trends in Biotechnology",
		"DOI": "10.1016/j.tibtech.2004.03.007",
		"ISSN": "0167-7799, 1879-3096",
		"issue": "5",
		"journalAbbreviation": "Trends in Biotechnology",
		"language": "English",
		"note": "publisher: Elsevier\nPMID: 15109811",
		"page": "245-252",
		"source": "www.cell.com",
		"title": "Metabolomics by numbers: acquiring and understanding global metabolite data",
		"title-short": "Metabolomics by numbers",
		"URL": "https://www.cell.com/trends/biotechnology/abstract/S0167-7799(04)00081-2",
		"volume": "22",
		"author": [
			{
				"family": "Goodacre",
				"given": "Royston"
			},
			{
				"family": "Vaidyanathan",
				"given": "Seetharaman"
			},
			{
				"family": "Dunn",
				"given": "Warwick B."
			},
			{
				"family": "Harrigan",
				"given": "George G."
			},
			{
				"family": "Kell",
				"given": "Douglas B."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					29
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2004",
					5,
					1
				]
			]
		},
		"citation-key": "goodacreMetabolomicsNumbersAcquiring2004"
	},
	{
		"id": "higashiStableIsotopeLabeledTracers2014",
		"type": "chapter",
		"abstract": "Advances in analytical methodologies, principally nuclear magnetic resonance spectroscopy (NMR) and mass spectrometry (MS), over the last decade have made large-scale analysis of the human metabolome a reality. This is leading to the reawakening of the importance of metabolism in human diseases, particularly widespread metabolic diseases such as cancer, diabetes, and obesity. Emerging NMR and MS atom-tracking technologies and informatics are poised to revolutionize metabolomics-based research because they deliver the high information throughput (HIT) that is needed for deciphering systems biochemistry. In particular, stable isotope-resolved metabolomics (SIRM) enables unambiguous tracking of individual atoms through compartmentalized metabolic networks in a wide range of experimental systems, including human subjects. MS offers a wide range of instrumental capabilities involving different levels of initial capital outlay and operating costs, ranging from gas-chromatography (GC) MS that is affordable by many individual laboratories to the HIT-supporting Fourier-transform (FT) class of MS that rivals NMR in cost and infrastructure support. This chapter focuses on sample preparation, instrument, and data processing procedures for these two extremes of MS instrumentation used in SIRM.",
		"collection-title": "Methods in Molecular Biology",
		"container-title": "Mass Spectrometry in Metabolomics: Methods and Protocols",
		"event-place": "New York, NY",
		"ISBN": "978-1-4939-1258-2",
		"language": "en",
		"note": "DOI: 10.1007/978-1-4939-1258-2_11",
		"page": "147-167",
		"publisher": "Springer",
		"publisher-place": "New York, NY",
		"source": "Springer Link",
		"title": "Stable Isotope-Labeled Tracers for Metabolic Pathway Elucidation by GC-MS and FT-MS",
		"URL": "https://doi.org/10.1007/978-1-4939-1258-2_11",
		"author": [
			{
				"family": "Higashi",
				"given": "Richard M."
			},
			{
				"family": "Fan",
				"given": "Teresa W.-M."
			},
			{
				"family": "Lorkiewicz",
				"given": "Pawel K."
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			},
			{
				"family": "Lane",
				"given": "Andrew N."
			}
		],
		"editor": [
			{
				"family": "Raftery",
				"given": "Daniel"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					30
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2014"
				]
			]
		},
		"citation-key": "higashiStableIsotopeLabeledTracers2014"
	},
	{
		"id": "peakeNewLipidSoftware",
		"type": "article-journal",
		"language": "en",
		"page": "7",
		"source": "Zotero",
		"title": "A New Lipid Software Workflow for Processing Orbitrap-based Global Lipidomics Data in Translational and Systems Biology Research",
		"author": [
			{
				"family": "Peake",
				"given": "David A"
			},
			{
				"family": "Yokoi",
				"given": "Yasuto"
			},
			{
				"family": "Wang",
				"given": "Junhua"
			},
			{
				"family": "Huang",
				"given": "Yingying"
			}
		],
		"citation-key": "peakeNewLipidSoftware"
	},
	{
		"id": "sellersPyruvateCarboxylaseCritical2015",
		"type": "article-journal",
		"container-title": "The Journal of Clinical Investigation",
		"DOI": "10.1172/JCI72873",
		"ISSN": "0021-9738",
		"issue": "2",
		"journalAbbreviation": "J Clin Invest",
		"language": "en",
		"note": "publisher: American Society for Clinical Investigation\nPMID: 0",
		"page": "687-698",
		"source": "www.jci.org",
		"title": "Pyruvate carboxylase is critical for non–small-cell lung cancer proliferation",
		"URL": "https://www.jci.org/articles/view/72873",
		"volume": "125",
		"author": [
			{
				"family": "Sellers",
				"given": "Katherine"
			},
			{
				"family": "Fox",
				"given": "Matthew P."
			},
			{
				"family": "Bousamra",
				"given": "Michael"
			},
			{
				"family": "Slone",
				"given": "Stephen P."
			},
			{
				"family": "Higashi",
				"given": "Richard M."
			},
			{
				"family": "Miller",
				"given": "Donald M."
			},
			{
				"family": "Wang",
				"given": "Yali"
			},
			{
				"family": "Yan",
				"given": "Jun"
			},
			{
				"family": "Yuneva",
				"given": "Mariia O."
			},
			{
				"family": "Deshpande",
				"given": "Rahul"
			},
			{
				"family": "Lane",
				"given": "Andrew N."
			},
			{
				"family": "Fan",
				"given": "Teresa W.-M."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					30
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2015",
					2,
					2
				]
			]
		},
		"citation-key": "sellersPyruvateCarboxylaseCritical2015"
	},
	{
		"id": "harrisDiverseMechanismsGrowth2012",
		"type": "article-journal",
		"abstract": "The rationale of this dose matching/dose escalating study was to compare a panel of flavonoids—luteolin, resveratrol, and quercetin—against the metabolite flux-controlling properties of a synthetic targeted fatty acid synthase inhibitor drug C75 on multiple macromolecule synthesis pathways in pancreatic tumor cells using [1,2-13C2]-d-glucose as the single precursor metabolic tracer. MIA PaCa-2 pancreatic adenocarcinoma cells were cultured for 48 h in the presence of 0.1% DMSO (control), or 50 or 100 μM of each test compound, while intracellular glycogen, RNA ribose, palmitate and cholesterol as well as extra cellular 13CO2, lactate and glutamate production patterns were measured using gas chromatography/mass spectrometry (GC/MS) and stable isotope-based dynamic metabolic profiling (SiDMAP). The use of 50% [1,2-13C2]-d-glucose as tracer resulted in an average of 24 excess 13CO2 molecules for each 1,000 CO2 molecule in the culture media, which was decreased by 29 and 33% (P < 0.01) with 100 μM C75 and luteolin treatments, respectively. Extracellular tracer glucose-derived 13C-labeled lactate fractions (Σm) were between 45.52 and 47.49% in all cultures with a molar ratio of 2.47% M + 1/Σm lactate produced indirectly by direct oxidation of glucose in the pentose cycle in control cultures; treatment with 100 μM C75 and luteolin decreased this figure to 1.80 and 1.67%. The tracer glucose-derived 13C labeled fraction (Σm) of ribonucleotide ribose was 34.73% in controls, which was decreased to 20.58 and 8.45% with C75, 16.15 and 6.86% with luteolin, 27.66 and 19.25% with resveratrol, and 30.09 and 25.67% with quercetin, respectively. Luteolin effectively decreased nucleotide precursor synthesis pentose cycle flux primarily via the oxidative branch, where we observed a 41.74% flux (M + 1/Σm) in control cells, in comparison with only a 37.19%, 32.74%, or a 26.57%, 25.47% M + 1/Σm flux (P < 0.001) after 50 or 100 μM C75 or luteolin treatment. Intracellular de novo fatty acid palmitate (C16:0) synthesis was severely and equally blocked by C75 and luteolin treatments indicated by the 5.49% (control), 2.29 or 2.47% (C75) and 2.21 or 2.73% (luteolin) tracer glucose-derived 13C-labeled fractions, respectively. On the other hand there was a significant 192 and 159% (P < 0.001), and a 103 and 117% (P < 0.01) increase in tracer glucose-derived cholesterol after C75 or luteolin treatment. Only resveratrol and quercetin at 100 μM inhibited tracer glucose-derived glycogen labeling (Σm) and turnover by 34.8 and 23.8%, respectively. The flavonoid luteolin possesses equal efficacy to inhibit fatty acid palmitate de novo synthesis as well as nucleotide RNA ribose turnover via the oxidative branch of the pentose cycle in comparison with the targeted fatty acid synthase inhibitor synthetic compound C75. Luteolin is also effective in stringently controlling glucose entry and anaplerosis in the TCA cycle, while it promotes less glucose flux towards cholesterol synthesis than that of C75. In contrast, quercetin and resveratrol inhibit glycogen synthesis and turnover as their underlying mechanism of controlling tumor cell proliferation. Therefore the flavonoid luteolin controls fatty and nucleic acid syntheses as well as energy production with pharmacological strength, which can be explored as a non-toxic natural treatment modality for pancreatic cancer.",
		"container-title": "Metabolomics",
		"DOI": "10.1007/s11306-011-0300-9",
		"ISSN": "1573-3890",
		"issue": "2",
		"journalAbbreviation": "Metabolomics",
		"language": "en",
		"page": "201-210",
		"source": "Springer Link",
		"title": "Diverse mechanisms of growth inhibition by luteolin, resveratrol, and quercetin in MIA PaCa-2 cells: a comparative glucose tracer study with the fatty acid synthase inhibitor C75",
		"title-short": "Diverse mechanisms of growth inhibition by luteolin, resveratrol, and quercetin in MIA PaCa-2 cells",
		"URL": "https://doi.org/10.1007/s11306-011-0300-9",
		"volume": "8",
		"author": [
			{
				"family": "Harris",
				"given": "Diane M."
			},
			{
				"family": "Li",
				"given": "Luyi"
			},
			{
				"family": "Chen",
				"given": "Monica"
			},
			{
				"family": "Lagunero",
				"given": "F. Tracy"
			},
			{
				"family": "Go",
				"given": "Vay Liang W."
			},
			{
				"family": "Boros",
				"given": "Laszlo G."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					30
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2012",
					4,
					1
				]
			]
		},
		"citation-key": "harrisDiverseMechanismsGrowth2012"
	},
	{
		"id": "mitchellSmallMoleculeIsotope2019",
		"type": "article-journal",
		"abstract": "Improvements in Fourier transform mass spectrometry (FT-MS) enable increasingly more complex experiments in the field of metabolomics. What is directly detected in FT-MS spectra are spectral features (peaks) that correspond to sets of adducted and charged forms of specific molecules in the sample. The robust assignment of these features is an essential step for MS-based metabolomics experiments, but the sheer complexity of what is detected and a variety of analytically introduced variance, errors, and artifacts has hindered the systematic analysis of complex patterns of observed peaks with respect to isotope content. We have developed a method called SMIRFE that detects small biomolecules and determines their elemental molecular formula (EMF) using detected sets of isotopologue peaks sharing the same EMF. SMIRFE does not use a database of known metabolite formulas; instead a nearly comprehensive search space of all isotopologues within a mass range is constructed and used for assignment. This search space can be tailored for different isotope labeling patterns expected in different stable isotope tracing experiments. Using consumer-level computing equipment, a large search space of 2000 Da was constructed, and assignment performance was evaluated and validated using verified assignments on a pair of peak lists derived from spectra containing unlabeled and 15N-labeled versions of amino acids derivatized using ethylchloroformate. SMIRFE identified 18 of 18 predicted derivatized EMFs, and each assignment was evaluated statistically and assigned an e-value representing the probability to occur by chance.",
		"container-title": "Analytical Chemistry",
		"DOI": "10.1021/acs.analchem.9b00748",
		"ISSN": "0003-2700",
		"issue": "14",
		"journalAbbreviation": "Anal. Chem.",
		"note": "publisher: American Chemical Society",
		"page": "8933-8940",
		"source": "ACS Publications",
		"title": "Small Molecule Isotope Resolved Formula Enumeration: A Methodology for Assigning Isotopologues and Metabolite Formulas in Fourier Transform Mass Spectra",
		"title-short": "Small Molecule Isotope Resolved Formula Enumeration",
		"URL": "https://doi.org/10.1021/acs.analchem.9b00748",
		"volume": "91",
		"author": [
			{
				"family": "Mitchell",
				"given": "Joshua M."
			},
			{
				"family": "Flight",
				"given": "Robert M."
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					3,
					30
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2019",
					7,
					16
				]
			]
		},
		"citation-key": "mitchellSmallMoleculeIsotope2019"
	},
	{
		"id": "mitchellDerivingLipidClassification2020",
		"type": "article-journal",
		"abstract": "Despite instrument and algorithmic improvements, the untargeted and accurate assignment of metabolites remains an unsolved problem in metabolomics. New assignment methods such as our SMIRFE algorithm can assign elemental molecular formulas to observed spectral features in a highly untargeted manner without orthogonal information from tandem MS or chromatography. However, for many lipidomics applications, it is necessary to know at least the lipid category or class that is associated with a detected spectral feature to derive a biochemical interpretation. Our goal is to develop a method for robustly classifying elemental molecular formula assignments into lipid categories for an application to SMIRFE-generated assignments. Using a Random Forest machine learning approach, we developed a method that can predict lipid category and class from SMIRFE non-adducted molecular formula assignments. Our methods achieve high average predictive accuracy (>90%) and precision (>83%) across all eight of the lipid categories in the LIPIDMAPS database. Classification performance was evaluated using sets of theoretical, data-derived, and artifactual molecular formulas. Our methods enable the lipid classification of non-adducted molecular formula assignments generated by SMIRFE without orthogonal information, facilitating the biochemical interpretation of untargeted lipidomics experiments. This lipid classification appears insufficient for validating single-spectrum assignments, but could be useful in cross-spectrum assignment validation.",
		"container-title": "Metabolites",
		"DOI": "10.3390/metabo10030122",
		"ISSN": "2218-1989",
		"issue": "3",
		"journalAbbreviation": "Metabolites",
		"language": "eng",
		"note": "PMID: 32214009\nPMCID: PMC7143220",
		"page": "E122",
		"source": "PubMed",
		"title": "Deriving Lipid Classification Based on Molecular Formulas",
		"volume": "10",
		"author": [
			{
				"family": "Mitchell",
				"given": "Joshua M."
			},
			{
				"family": "Flight",
				"given": "Robert M."
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"issued": {
			"date-parts": [
				[
					"2020",
					3,
					24
				]
			]
		},
		"citation-key": "mitchellDerivingLipidClassification2020"
	},
	{
		"id": "wangAccuCor2IsotopeNatural2021",
		"type": "article-journal",
		"abstract": "Stable isotope labeling techniques have been widely applied in the field of metabolomics and proteomics. Before the measured mass spectral data can be used for quantitative analysis, it must be accurately corrected for isotope natural abundance and tracer isotopic impurity. Despite the increasing popularity of dual-isotope tracing strategy such as 13C-15N or 13C-2H, there are no accurate tools for correcting isotope natural abundance for such experiments in a resolution-dependent manner. Here, we present AccuCor2 as an R-based tool to perform the correction for 13C-15N or 13C-2H labeling experiments. Our method uses a newly designed algorithm to construct the correction matrices that link labeling pattern and measured mass fractions, then use non-negative least-squares to solve the labeling patterns. Our results show that the dual-isotope experiments often require a mass resolution that is high enough to resolve 13C and 15N or 13C and 2H. Otherwise, the labeling pattern is not solvable. However, this mass resolution may not be sufficiently high to resolve other non-tracer elements such as oxygen or sulfur from the tracer elements. Therefore, we design AccuCor2 to perform the correction based on the actual mass resolution of the measurements. Using both simulated and experimental data, we show that AccuCor2 performs accurate and resolution-dependent correction for dual-isotope tracer data.",
		"container-title": "Laboratory Investigation",
		"DOI": "10.1038/s41374-021-00631-4",
		"ISSN": "1530-0307",
		"issue": "10",
		"journalAbbreviation": "Lab Invest",
		"language": "en",
		"note": "number: 10\npublisher: Nature Publishing Group",
		"page": "1403-1410",
		"source": "www.nature.com",
		"title": "AccuCor2: isotope natural abundance correction for dual-isotope tracer experiments",
		"title-short": "AccuCor2",
		"URL": "https://www.nature.com/articles/s41374-021-00631-4",
		"volume": "101",
		"author": [
			{
				"family": "Wang",
				"given": "Yujue"
			},
			{
				"family": "Parsons",
				"given": "Lance R."
			},
			{
				"family": "Su",
				"given": "Xiaoyang"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					4,
					4
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2021",
					10
				]
			]
		},
		"citation-key": "wangAccuCor2IsotopeNatural2021"
	},
	{
		"id": "jinMoietyModelingFramework2019",
		"type": "article-journal",
		"abstract": "Stable isotope tracing can follow individual atoms through metabolic transformations through the detection of the incorporation of stable isotope within metabolites. This resulting data can be interpreted in terms related to metabolic flux. However, detection of a stable isotope in metabolites by mass spectrometry produces a profile of isotopologue peaks that requires deconvolution to ascertain the localization of isotope incorporation.",
		"container-title": "BMC Bioinformatics",
		"DOI": "10.1186/s12859-019-3096-7",
		"ISSN": "1471-2105",
		"issue": "1",
		"journalAbbreviation": "BMC Bioinformatics",
		"page": "524",
		"source": "BioMed Central",
		"title": "Moiety modeling framework for deriving moiety abundances from mass spectrometry measured isotopologues",
		"URL": "https://doi.org/10.1186/s12859-019-3096-7",
		"volume": "20",
		"author": [
			{
				"family": "Jin",
				"given": "Huan"
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					4,
					4
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2019",
					10,
					28
				]
			]
		},
		"citation-key": "jinMoietyModelingFramework2019"
	},
	{
		"id": "jinRobustMoietyModel2020",
		"type": "article-journal",
		"abstract": "Stable isotope resolved metabolomics (SIRM) experiments use stable isotope tracers to provide superior metabolomics datasets for metabolic flux analysis and metabolic modeling. Since assumptions of model correctness can seriously compromise interpretation of metabolic flux results, we have developed a metabolic modeling software package specifically designed for moiety model comparison and selection based on the metabolomics data provided. Here, we tested the effectiveness of model selection with two time-series mass spectrometry (MS) isotopologue datasets for uridine diphosphate N-acetyl-d-glucosamine (UDP-GlcNAc) generated from different platforms utilizing direct infusion nanoelectrospray and liquid chromatography. Analysis results demonstrate the robustness of our model selection methods by the successful selection of the optimal model from over 40 models provided. Moreover, the effects of specific optimization methods, degree of optimization, selection criteria, and specific objective functions on model selection are illustrated. Overall, these results indicate that over-optimization can lead to model selection failure, but combining multiple datasets can help control this overfitting effect. The implication is that SIRM datasets in public repositories of reasonable quality can be combined with newly acquired datasets to improve model selection. Furthermore, curation efforts of public metabolomics repositories to maintain high data quality could have a huge impact on future metabolic modeling efforts.",
		"container-title": "Metabolites",
		"DOI": "10.3390/metabo10030118",
		"ISSN": "2218-1989",
		"issue": "3",
		"journalAbbreviation": "Metabolites",
		"language": "eng",
		"note": "PMID: 32245221\nPMCID: PMC7143054",
		"page": "E118",
		"source": "PubMed",
		"title": "Robust Moiety Model Selection Using Mass Spectrometry Measured Isotopologues",
		"volume": "10",
		"author": [
			{
				"family": "Jin",
				"given": "Huan"
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"issued": {
			"date-parts": [
				[
					"2020",
					3,
					21
				]
			]
		},
		"citation-key": "jinRobustMoietyModel2020"
	},
	{
		"id": "Cleveland1992loess",
		"type": "chapter",
		"container-title": "Statistical models in s",
		"note": "section: 8\ntex.added-at: 2018-07-20T15:36:50.000+0200\ntex.biburl: https://www.bibsonomy.org/bibtex/249dc786266d86d0cc54ed6ccb2fe9894/gron\ntex.interhash: 7d86e5cc7c53a61bc8fead3dd2eb3b99\ntex.intrahash: 49dc786266d86d0cc54ed6ccb2fe9894\ntex.timestamp: 2018-07-20T15:36:50.000+0200",
		"publisher": "Wadsworth & Brooks/Cole",
		"title": "Local regression models",
		"author": [
			{
				"family": "Cleveland",
				"given": "W. S."
			},
			{
				"family": "Grosse",
				"given": "E."
			},
			{
				"family": "Shyu",
				"given": "W. M."
			}
		],
		"editor": [
			{
				"family": "Chambers",
				"given": "J.M."
			},
			{
				"family": "Hastie",
				"given": "T.J."
			}
		],
		"issued": {
			"date-parts": [
				[
					"1992"
				]
			]
		},
		"citation-key": "Cleveland1992loess"
	},
	{
		"id": "gattoMSnbaseBioconductorPackage2012",
		"type": "article-journal",
		"container-title": "Bioinformatics (Oxford, England)",
		"journalAbbreviation": "Bioinformatics",
		"page": "288-289",
		"title": "MSnbase - an R/Bioconductor package for isobaric tagged mass spectrometry data visualization, processing and quantitation",
		"volume": "28",
		"author": [
			{
				"family": "Gatto",
				"given": "Laurent"
			},
			{
				"family": "Lilley",
				"given": "Kathryn"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2012"
				]
			]
		},
		"citation-key": "gattoMSnbaseBioconductorPackage2012"
	},
	{
		"id": "gattoMSnbaseEfficientElegant2020",
		"type": "article-journal",
		"container-title": "bioRxiv : the preprint server for biology",
		"journalAbbreviation": "bioRxiv",
		"title": "MSnbase, efficient and elegant R-based processing and visualisation of raw mass spectrometry data",
		"author": [
			{
				"family": "Gatto",
				"given": "Laurent"
			},
			{
				"family": "Gibb",
				"given": "Sebastian"
			},
			{
				"family": "Rainer",
				"given": "Johannes"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2020"
				]
			]
		},
		"citation-key": "gattoMSnbaseEfficientElegant2020"
	},
	{
		"id": "gentlemanGenefilterMethodsFiltering2021",
		"type": "report",
		"genre": "manual",
		"title": "genefilter: methods for filtering genes from high-throughput experiments",
		"author": [
			{
				"family": "Gentleman",
				"given": "Robert"
			},
			{
				"family": "Carey",
				"given": "Vincent J."
			},
			{
				"family": "Huber",
				"given": "Wolfgang"
			},
			{
				"family": "Hahne",
				"given": "Florian"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "gentlemanGenefilterMethodsFiltering2021"
	},
	{
		"id": "rcoreteamLanguageEnvironmentStatistical2021a",
		"type": "report",
		"event-place": "Vienna, Austria",
		"genre": "manual",
		"note": "tex.organization: R Foundation for Statistical Computing",
		"publisher-place": "Vienna, Austria",
		"title": "R: A language and environment for statistical computing",
		"URL": "https://www.R-project.org/",
		"author": [
			{
				"literal": "R Core Team"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "rcoreteamLanguageEnvironmentStatistical2021a"
	},
	{
		"id": "vanrossumPython3",
		"type": "book",
		"event-place": "Scotts Valley, CA",
		"ISBN": "1-4414-1269-7",
		"publisher": "CreateSpace",
		"publisher-place": "Scotts Valley, CA",
		"title": "Python 3 reference manual",
		"author": [
			{
				"family": "Van Rossum",
				"given": "Guido"
			},
			{
				"family": "Drake",
				"given": "Fred L."
			}
		],
		"issued": {
			"date-parts": [
				[
					"2009"
				]
			]
		},
		"citation-key": "vanrossumPython3"
	},
	{
		"id": "landauTargetsPackageDynamic2021",
		"type": "article-journal",
		"container-title": "Journal of Open Source Software",
		"issue": "57",
		"page": "2959",
		"title": "The targets R package: a dynamic Make-like function-oriented pipeline toolkit for reproducibility and high-performance computing",
		"URL": "https://doi.org/10.21105/joss.02959",
		"volume": "6",
		"author": [
			{
				"family": "Landau",
				"given": "William Michael"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "landauTargetsPackageDynamic2021"
	},
	{
		"id": "wickhamGgplot2ElegantGraphics2016",
		"type": "book",
		"ISBN": "978-3-319-24277-4",
		"publisher": "Springer-Verlag New York",
		"title": "ggplot2: Elegant graphics for data analysis",
		"URL": "https://ggplot2.tidyverse.org",
		"author": [
			{
				"family": "Wickham",
				"given": "Hadley"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2016"
				]
			]
		},
		"citation-key": "wickhamGgplot2ElegantGraphics2016"
	},
	{
		"id": "pedersenPatchworkComposerPlots2020",
		"type": "report",
		"genre": "manual",
		"title": "patchwork: The composer of plots",
		"URL": "https://CRAN.R-project.org/package=patchwork",
		"author": [
			{
				"family": "Pedersen",
				"given": "Thomas Lin"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2020"
				]
			]
		},
		"citation-key": "pedersenPatchworkComposerPlots2020"
	},
	{
		"id": "guComplexHeatmapsReveal2016a",
		"type": "article-journal",
		"container-title": "Bioinformatics (Oxford, England)",
		"journalAbbreviation": "Bioinformatics",
		"title": "Complex heatmaps reveal patterns and correlations in multidimensional genomic data",
		"author": [
			{
				"family": "Gu",
				"given": "Zuguang"
			},
			{
				"family": "Eils",
				"given": "Roland"
			},
			{
				"family": "Schlesner",
				"given": "Matthias"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2016"
				]
			]
		},
		"citation-key": "guComplexHeatmapsReveal2016a"
	},
	{
		"id": "usheyRenvProjectEnvironments2022",
		"type": "report",
		"genre": "manual",
		"title": "renv: Project environments",
		"URL": "https://CRAN.R-project.org/package=renv",
		"author": [
			{
				"family": "Ushey",
				"given": "Kevin"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2022"
				]
			]
		},
		"citation-key": "usheyRenvProjectEnvironments2022"
	},
	{
		"id": "allaireRmarkdownDynamicDocuments2021",
		"type": "report",
		"genre": "manual",
		"title": "rmarkdown: Dynamic documents for r",
		"URL": "https://github.com/rstudio/rmarkdown",
		"author": [
			{
				"family": "Allaire",
				"given": "JJ"
			},
			{
				"family": "Xie",
				"given": "Yihui"
			},
			{
				"family": "McPherson",
				"given": "Jonathan"
			},
			{
				"family": "Luraschi",
				"given": "Javier"
			},
			{
				"family": "Ushey",
				"given": "Kevin"
			},
			{
				"family": "Atkins",
				"given": "Aron"
			},
			{
				"family": "Wickham",
				"given": "Hadley"
			},
			{
				"family": "Cheng",
				"given": "Joe"
			},
			{
				"family": "Chang",
				"given": "Winston"
			},
			{
				"family": "Iannone",
				"given": "Richard"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "allaireRmarkdownDynamicDocuments2021"
	},
	{
		"id": "xieMarkdownDefinitiveGuide2018",
		"type": "book",
		"event-place": "Boca Raton, Florida",
		"publisher": "Chapman and Hall/CRC",
		"publisher-place": "Boca Raton, Florida",
		"title": "R markdown: The definitive guide",
		"URL": "https://bookdown.org/yihui/rmarkdown",
		"author": [
			{
				"family": "Xie",
				"given": "Yihui"
			},
			{
				"family": "Allaire",
				"given": "J.J."
			},
			{
				"family": "Grolemund",
				"given": "Garrett"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2018"
				]
			]
		},
		"citation-key": "xieMarkdownDefinitiveGuide2018"
	},
	{
		"id": "xieMarkdownCookbook2020",
		"type": "book",
		"event-place": "Boca Raton, Florida",
		"publisher": "Chapman and Hall/CRC",
		"publisher-place": "Boca Raton, Florida",
		"title": "R markdown cookbook",
		"URL": "https://bookdown.org/yihui/rmarkdown-cookbook",
		"author": [
			{
				"family": "Xie",
				"given": "Yihui"
			},
			{
				"family": "Dervieux",
				"given": "Christophe"
			},
			{
				"family": "Riederer",
				"given": "Emily"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2020"
				]
			]
		},
		"citation-key": "xieMarkdownCookbook2020"
	},
	{
		"id": "flightVisualizationQualityControlDevelopmentVisualization2021",
		"type": "report",
		"genre": "manual",
		"title": "visualizationQualityControl: Development of visualization methods for quality control",
		"URL": "https://moseleybioinformaticslab.github.io/visualizationQualityControl https://github.com/moseleybioinformaticslab/visualizationQualityControl",
		"author": [
			{
				"family": "Flight",
				"given": "Robert M"
			},
			{
				"family": "Moseley",
				"given": "Hunter NB"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "flightVisualizationQualityControlDevelopmentVisualization2021"
	},
	{
		"id": "wickhamDplyrGrammarData2022",
		"type": "report",
		"genre": "manual",
		"title": "dplyr: A grammar of data manipulation",
		"URL": "https://CRAN.R-project.org/package=dplyr",
		"author": [
			{
				"family": "Wickham",
				"given": "Hadley"
			},
			{
				"family": "François",
				"given": "Romain"
			},
			{
				"family": "Henry",
				"given": "Lionel"
			},
			{
				"family": "Müller",
				"given": "Kirill"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2022"
				]
			]
		},
		"citation-key": "wickhamDplyrGrammarData2022"
	},
	{
		"id": "wickhamTidyrTidyMessy2022",
		"type": "report",
		"genre": "manual",
		"title": "tidyr: Tidy messy data",
		"URL": "https://CRAN.R-project.org/package=tidyr",
		"author": [
			{
				"family": "Wickham",
				"given": "Hadley"
			},
			{
				"family": "Girlich",
				"given": "Maximilian"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2022"
				]
			]
		},
		"citation-key": "wickhamTidyrTidyMessy2022"
	},
	{
		"id": "vaughanFurrrApplyMapping2021a",
		"type": "report",
		"genre": "manual",
		"title": "furrr: Apply mapping functions in parallel using futures",
		"URL": "https://CRAN.R-project.org/package=furrr",
		"author": [
			{
				"family": "Vaughan",
				"given": "Davis"
			},
			{
				"family": "Dancho",
				"given": "Matt"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "vaughanFurrrApplyMapping2021a"
	},
	{
		"id": "wilkeGgridgesRidgelinePlots2021",
		"type": "report",
		"genre": "manual",
		"title": "ggridges: Ridgeline Plots in 'ggplot2'",
		"URL": "https://CRAN.R-project.org/package=ggridges",
		"author": [
			{
				"family": "Wilke",
				"given": "Claus O."
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "wilkeGgridgesRidgelinePlots2021"
	},
	{
		"id": "pedersenGgforceAcceleratingGgplot22021",
		"type": "report",
		"genre": "manual",
		"title": "ggforce: Accelerating 'ggplot2'",
		"URL": "https://CRAN.R-project.org/package=ggforce",
		"author": [
			{
				"family": "Pedersen",
				"given": "Thomas Lin"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2021"
				]
			]
		},
		"citation-key": "pedersenGgforceAcceleratingGgplot22021"
	},
	{
		"id": "sampfordTruncatedNegativeBinomial1955a",
		"type": "article-journal",
		"container-title": "Biometrika",
		"DOI": "10.2307/2333422",
		"ISSN": "00063444",
		"issue": "1/2",
		"journalAbbreviation": "Biometrika",
		"page": "58",
		"source": "DOI.org (Crossref)",
		"title": "The Truncated Negative Binomial Distribution",
		"URL": "https://www.jstor.org/stable/2333422?origin=crossref",
		"volume": "42",
		"author": [
			{
				"family": "Sampford",
				"given": "M. R."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					4,
					12
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"1955",
					6
				]
			]
		},
		"citation-key": "sampfordTruncatedNegativeBinomial1955a"
	},
	{
		"id": "flightMoseleyBioinformaticsLabManuscriptPeakCharacterization2022",
		"type": "article-journal",
		"abstract": "first draft of manuscript w/ almost everything. need to get a doi ...",
		"note": "DOI: 10.5281/zenodo.6453346",
		"source": "Zenodo",
		"title": "MoseleyBioinformaticsLab/manuscript.peakCharacterization:",
		"title-short": "MoseleyBioinformaticsLab/manuscript.peakCharacterization",
		"URL": "https://zenodo.org/record/6453346",
		"author": [
			{
				"family": "Flight",
				"given": "Robert M."
			},
			{
				"family": "Mitchell",
				"given": "Joshua M."
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					4,
					12
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2022",
					4,
					12
				]
			]
		},
		"citation-key": "flightMoseleyBioinformaticsLabManuscriptPeakCharacterization2022"
	},
	{
		"id": "flightMoseleyBioinformaticsLabFTMSPeakCharacterization2022",
		"type": "book",
		"abstract": "This is the version that was used for the manuscript describing the methods implemented here.",
		"note": "DOI: 10.5281/zenodo.6453304",
		"publisher": "Zenodo",
		"source": "Zenodo",
		"title": "MoseleyBioinformaticsLab/FTMS.peakCharacterization: v0.1.102",
		"title-short": "MoseleyBioinformaticsLab/FTMS.peakCharacterization",
		"URL": "https://zenodo.org/record/6453304",
		"author": [
			{
				"family": "Flight",
				"given": "Robert M."
			},
			{
				"family": "Moseley",
				"given": "Hunter N. B."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					4,
					12
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2022",
					4,
					12
				]
			]
		},
		"citation-key": "flightMoseleyBioinformaticsLabFTMSPeakCharacterization2022"
	}
]